[
  {
    "link": "https://www.reddit.com/r/riddles/comments/6fczas/a_man_walks_into_a_bar_and_asks_for_a_glass_of/?tl=pt-br",
    "titulo": "O Copo de Água",
    "dificuldade": "1",
    "enredo": "Um pedido de água, uma resposta armada.",
    "contexto": "Um homem entra num bar e pede um copo de água. O barman saca uma arma e aponta para ele. O homem diz 'Obrigado' e vai embora. Por quê?",
    "solucao": "O homem estava com soluços. O barman percebeu e usou a arma para lhe dar um susto, o que curou os soluços. O homem, aliviado, agradeceu e foi embora.",
    "comentarios": "Um enigma clássico de nível fácil. A chave é descobrir o motivo 'oculto' do pedido de água, que não era sede. A reação do barman é a pista para a cura."
  },
  {
    "link": "https://m3.ime.unicamp.br/arquivos/1075/conclusoesprecipitadas-guia.pdf",
    "titulo": "Romeu e Julieta",
    "dificuldade": "2",
    "enredo": "Uma cena de morte trágica... ou nem tanto.",
    "contexto": "Romeu e Julieta são encontrados mortos no chão de um quarto. Ao redor deles, há cacos de vidro e uma poça de água. A janela está aberta. Como eles morreram?",
    "solucao": "Romeu e Julieta eram peixinhos dourados. Uma corrente de ar que entrou pela janela derrubou o aquário de vidro, que se quebrou no chão. Longe da água, eles morreram asfixiados.",
    "comentarios": "A dificuldade aqui é moderada, pois os nomes 'Romeu e Julieta' são uma forte pista falsa que induz a pensar em pessoas. A primeira pergunta a se fazer é 'Quem eram eles?'."
  },
  {
    "link": "https://www.reddit.com/r/riddles/comments/fff0un/a_man_is_found_hanging_from_the_ceiling_he_is/?tl=pt-br",
    "titulo": "O Suicídio Impossível",
    "dificuldade": "3",
    "enredo": "Um homem morto em um galpão vazio.",
    "contexto": "Um homem é encontrado enforcado no meio de um galpão completamente vazio. A corda está amarrada em uma viga muito alta. Não há caixas, escadas ou móvel algum. A única coisa no chão, diretamente abaixo dele, é uma grande poça de água. Como ele conseguiu se enforcar?",
    "solucao": "O homem subiu em um grande bloco de gelo, amarrou a corda no pescoço e esperou o gelo derreter. A poça de água é o que restou do bloco.",
    "comentarios": "Este enigma é difícil pois exige que se pense em um objeto que se encaixe na cena mas que tenha desaparecido. A poça de água é a única pista para a 'escada' que foi usada."
  },
  {
    "link": "https://noticiahoje.net/um-exemplo-do-que-e-estar-no-lugar-errado-na-hora-errada-por-denilson-araujo/",
    "titulo": "O Mergulhador na Floresta",
    "dificuldade": "4",
    "enredo": "Um corpo encontrado em um local impossível.",
    "contexto": "No meio de uma floresta completamente queimada, encontram o corpo de um homem usando um traje completo de mergulho, com cilindro e pés-de-pato. A autópsia revela que ele morreu de múltiplas lesões internas, não por queimaduras. Como ele foi parar ali?",
    "solucao": "O homem estava mergulhando no oceano. Um avião-tanque, usado para combater o incêndio florestal, coletou água do mar e acidentalmente 'pescou' o mergulhador junto. Ele foi então despejado de grande altitude sobre a floresta em chamas.",
    "comentarios": "Nível muito difícil. A solução é extremamente improvável e requer um salto lógico gigante, conectando dois cenários completamente distintos (oceano e incêndio) através de um mecanismo externo (o avião-tanque)."
  }
]